# Random forest

#### salary pridiction   more than 1000k

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sab
%matplotlib inline

### github se data liya

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/9_decision_tree/salaries.csv')
df.head(2)

  company              job     degree  salary_more_then_100k
0  google  sales executive  bachelors                      0
1  google  sales executive    masters                      0

In [3]:
x = df.iloc[: , :3]
y = df['salary_more_then_100k']

## hum Label Encoder use karenge

#### Label Encoder table ki text values ko 0  1  2   me badalta hai

In [4]:
from sklearn.preprocessing import LabelEncoder
le_company = LabelEncoder()
le_job = LabelEncoder()
le_degree = LabelEncoder()

###### new columns create karenge

In [5]:
df['company_n'] = le_company.fit_transform(df['company'])
df['job_n'] = le_company.fit_transform(df['job'])
df['degree_n'] = le_company.fit_transform(df['degree'])

In [6]:
df.head(9)

,company,job,degree,salary_more_then_100k,company_n,job_n,degree_n
0,google,sales executive,bachelors,0,2,2,0
1,google,sales executive,masters,0,2,2,1
2,google,business manager,bachelors,1,2,0,0
3,google,business manager,masters,1,2,0,1
4,google,computer programmer,bachelors,0,2,1,0
5,google,computer programmer,masters,1,2,1,1
6,abc pharma,sales executive,masters,0,0,2,1
7,abc pharma,computer programmer,bachelors,0,0,1,0
8,abc pharma,business manager,bachelors,0,0,0,0

In [8]:
df1 = df.drop(columns = ['company', 'job', 'degree', 'salary_more_then_100k'])
df1.head(2)

   company_n  job_n  degree_n
0          2      2         0
1          2      2         1

# Importing Decision Tree

In [18]:
from sklearn import tree
model = tree.DecisionTreeClassifier()

In [19]:
model.fit(df1, y)

DecisionTreeClassifier()

In [20]:
model.score(df1, y)

1.0

In [23]:
model.predict([[2, 0,1]])

array([1], dtype=int64)

## Saving ML Model

#